In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("main.csv")

In [5]:
df.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    619040 non-null  object
 1   open    619029 non-null  float64
 2   high    619032 non-null  float64
 3   low     619032 non-null  float64
 4   close   619040 non-null  float64
 5   volume  619040 non-null  int64
 6   Name    619040 non-null  object
dtypes: float64(4), int64(1), object(2)
memory usage: 33.1+ MB

In [7]:
df.dropna(inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 619029 entries, 0 to 619039
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    619029 non-null  object
 1   open    619029 non-null  float64
 2   high    619029 non-null  float64
 3   low     619029 non-null  float64
 4   close   619029 non-null  float64
 5   volume  619029 non-null  int64
 6   Name    619029 non-null  object
dtypes: float64(4), int64(1), object(2)
memory usage: 37.8+ MB

In [9]:
# Convert the 'date' column to a datetime object:
df['date'] = pd.to_datetime(df['date'])

In [10]:
# Set the 'date' column as the index:
df.set_index('date', inplace=True)

In [11]:
# Subset the data to include only the stocks you want to analyze:
subset = ['AAPL', 'GOOGL', 'AMZN', 'FB', 'MSFT']
df = df[df['Name'].isin(subset)]

In [12]:
df.head()

               open     high      low    close     volume  Name
date
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL

In [13]:
print(df.describe())

              open         high          low        close        volume
count  6295.000000  6295.000000  6295.000000  6295.000000  6.295000e+03
mean    303.152237   305.630772   300.408066   303.144455  2.569292e+07
std     310.052199   312.377265   307.396736   310.034711  2.895718e+07
min      22.990000    23.090000    22.670000    22.899000  5.211410e+05
25%      69.070700    69.697100    68.492500    69.069250  3.127776e+06
50%     127.030000   128.040000   126.000000   127.030000  1.973428e+07
75%     536.938200   541.452500   530.400000   536.740000  3.620080e+07
max    1477.390000  1498.000000  1450.040000  1450.890000  3.653806e+08

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6295 entries, 2013-02-08 to 2018-02-07
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   open    6295 non-null   float64
 1   high    6295 non-null   float64
 2   low     6295 non-null   float64
 3   close   6295 non-null   float64
 4   volume  6295 non-null   int64
 5   Name    6295 non-null   object
dtypes: float64(4), int64(1), object(1)
memory usage: 344.3+ KB

In [16]:
# Check for duplicates:
print(df.duplicated().sum())

# remove duplicates
df.drop_duplicates(inplace=True)

0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6295 entries, 2013-02-08 to 2018-02-07
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   open    6295 non-null   float64
 1   high    6295 non-null   float64
 2   low     6295 non-null   float64
 3   close   6295 non-null   float64
 4   volume  6295 non-null   int64
 5   Name    6295 non-null   object
dtypes: float64(4), int64(1), object(1)
memory usage: 344.3+ KB

In [18]:
df.to_csv("stocks_demo.csv")

In [19]:
df.head()

               open     high      low    close     volume  Name
date
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL